In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
import warnings

In [2]:
warnings.filterwarnings('ignore')  # In case there's any warning

sns.set_style('white')

### Exploratory Data Analysis

In [3]:
movie_info = pd.read_csv('Datasets/u.data', sep = '\t', header = None )

movie_info.head()

     0    1  2          3
0  196  242  3  881250949
1  186  302  3  891717742
2   22  377  1  878887116
3  244   51  2  880606923
4  166  346  1  886397596

In [4]:
# 0, 1, 2, 3 as column name makes no sense
columns_name = ['User_ID', 'Item_ID', 'Rating', 'Timestamp']

movie_info.columns = columns_name  #Explicitly defining column names

In [5]:
movie_info.head(5)

   User_ID  Item_ID  Rating  Timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [6]:
movie_info.shape

(100000, 4)

In [7]:
# How many unique users are there?

movie_info.User_ID.nunique()

943

In [8]:
# There is no movie name in movie_info dataframe


movie_titles = pd.read_csv("Datasets/u.item", sep = '\|', header  = None)

In [9]:
movie_titles.head(5)

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [10]:
# Amid of so many columns we are only required Item_ID & Titles

movie_titles = movie_titles[[0, 1]] #Item_ID, Title 
movie_titles.head(5)

   0                  1
0  1   Toy Story (1995)
1  2   GoldenEye (1995)
2  3  Four Rooms (1995)
3  4  Get Shorty (1995)
4  5     Copycat (1995)

In [11]:
# Lets rename the columns

movie_titles.columns = ['Item_ID', 'Title']

movie_titles.head(5)

   Item_ID              Title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [12]:
# Merge both of the DataFrames 

Movies = pd.merge(movie_info, movie_titles, on = 'Item_ID')

Movies.head()

   User_ID  Item_ID  Rating  Timestamp         Title
0      196      242       3  881250949  Kolya (1996)
1       63      242       3  875747190  Kolya (1996)
2      226      242       5  883888671  Kolya (1996)
3      154      242       3  879138235  Kolya (1996)
4      306      242       5  876503793  Kolya (1996)